/*
 * Student ID : 1690702095
 * Name       : Lab06
 * Section    : 129C
 * No.        : N/A
 * Course     : GI113 Computer Programming (GI)
 */

namespace Lab06
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //int lives = 0;

            //if (lives <=0)   //ใส่เงื่อนไขที่ต้องการเช็ค ค่าที่ได้ต้องเป็น bool (true / false)
            //{
            //    Console.WriteLine("Game Over!");  //โค๊ดด้านในจะรันก็ต่อเมื่อ if เป็น true เท่านั้น
            //}
            //else
            //{
            //    Console.WriteLine("Keep Fighting");
            //}

            ////ถ้า if ทำงานเสร็จแล้ว หรือ เป็น false จะทำงานต่อมาบรรทัดด้านนอทันที
            //Console.WriteLine("Continue Code");

            //int level = 10;
            //bool hasKey = true;
            //Console.Write("Your level (1-99): ");
            //bool inpurValid = int.TryParse(Console.ReadLine(), out int level);

            //if (!inpurValid || level < 1 || level > 99) //เงื่อนไขที่ถือว่าใส่ข้อมูลผิด
            //{
            //    Console.WriteLine("Invalid Level"); //เตือนเมื่อ user ใส่ข้อมูลผิด
            //}
            //// เมื่อใช้งานเงื่อนไขหลายเคส ให้เช็คลงจาก มากไปน้อย
            //if (level >= 10 && hasKey) //เงื่อนไข 1 มากกว่าหรือเท่ากับ 10 และต้องมี กุญแจ
            //{
            //    Console.WriteLine("Boss floor unlocked");
            //}
            //else if (level >= 5) //เงื่อนไข 2 ถ้ายังไม่ตรงเงื่อนไข 1
            //{
            //    if (hasKey)
            //    {
            //        Console.WriteLine("The door opens.");
            //    }
            //    else
            //    {
            //        Console.WriteLine("Locked. Find a key.");
            //    }
            //}
            //else //เมื่อไขไม่ตรงซักอัน
            //{
            //    Console.WriteLine("The door stay shut.");
            //}

            //bool isPosioned = true;

            //if (isPosioned) //เช็คว่าเป็นจริงมั้ย? หรือ (isPosioned == true)
            //{
            //    Console.WriteLine("You Died");
            //}
            //else if (!isPosioned) // เช็คว่าเป็นเท็จมั้ย หรือ else if (isPosioned == false)
            //{
            //    Console.WriteLine("You Lives");
            //}

            int PikachuHP = 219;
            int GengarHP = 180;
            int thunderboltAtk = 60;
            int electricballAtk = 90;
            int volttackleAtk = 180;
            int quicattackAtk = 45;
            int healPotion = 100;

            Console.WriteLine("===========>Pokemon Red<===========");
            Console.WriteLine("Pikachu VS Gengar What will Pikachu do?");
            Console.WriteLine();
            Console.WriteLine("ACTION 1: ThunderBolt");
            Console.WriteLine("ACTION 2: ElectricBall");
            Console.WriteLine("ACTION 3: Volt Tackle");
            Console.WriteLine("ACTION 4: Quick Attack");
            Console.WriteLine("ACTION 5: Use Potion");
            Console.WriteLine("ACTION 6: Run away");
            Console.WriteLine();
            Console.WriteLine("Choose your Action (1-6): ");
            bool userInput = int.TryParse(Console.ReadLine(), out int action);

            if (!userInput || action < 1 || action > 6)
            {
                Console.WriteLine("Invalid input, please choose number between 1-6 only");
            }
            else if (action == 1)
            {
                GengarHP -= thunderboltAtk;

                if (GengarHP <= 0)
                {
                    Console.WriteLine("Gengar fainted!");
                }
                else
                {
                    Console.WriteLine($"Pikachu use ThunderBolt, Gengar have {GengarHP} HP left.");
                }
            }
            else if (action == 2)
            {
                GengarHP -= electricballAtk;

                if (GengarHP <= 0)
                {
                    Console.WriteLine("Gengar fainted!");
                }
                else
                {
                    Console.WriteLine($"Pikachu use ElectricBall, Gengar have {GengarHP} HP left.");
                }
            }
            else if (action == 3)
            {
                GengarHP -= volttackleAtk;

                if (GengarHP <= 0)
                {
                    Console.WriteLine("Gengar fainted!");
                }
                else
                {
                    Console.WriteLine($"Pikachu use Volt Tackle, Gengar have {GengarHP} HP left.");
                }
            }
            else if (action == 4)
            {
                GengarHP -= quicattackAtk;

                if (GengarHP <= 0)
                {
                    Console.WriteLine("Gengar fainted!");
                }
                else
                {
                    Console.WriteLine($"Pikachu use Quick Attack, Gengar have {GengarHP} HP left.");
                }
            }
            else if (action == 5)
            {
                PikachuHP += healPotion;

                Console.WriteLine($"Use Potion to Pikachu, Now Pikachu have {PikachuHP} HP.");
            }
            else if (action == 6)
            {
                Console.WriteLine("Pikachu ran away!");
            }
            string titleArt = @"
.....;:.;:X....&..x.X:.x..xX.;+..x.................................................................
.....X..;:X....;.&X.:..$.&&&+;+.$..................................................................
......++;.++++....:..++.....:....:.................................................+...............
......................;.:&$$:.&$$:............................;:.......;+.;&x...:&&x...............
....................:+&..;.:&+&.;&.............................X&x;..;+&&&&&$&x&&&&x.::............
.......:........................................................&&&&Xx&&&&&&&&&&&&&&&x.............
.......&..+&$;&&....&&&&&&&&&&&&&&&&&&&&&&&&&&&&&+...............&&&&&&&&&&&&&&&&&&&&&x..X:........
.......&..x&&;&:...;&&&&&&&&&&&&&&&&&&&&&&&&&&&&&x...........$;..;&&&&&&&&&&&&&&&&&&&&&&&&&&:......
.......&....................................................$&&&&&&&;&&&&&&&&&;&&&&&&&&&&&&&:......
.......&;;+++++++++++++++++++++++++++++++++++++++&&&+........x&&&&&&xX$&&&&&X;;&&&&&&&&&&$.........
...............................................................+&&&&$&&&&&&&$$&&.&&&&&&&;..........
.................................................................x&&&.+:;&:X..;.&&&&&&&............
.................................................................:&&&&.;.;.:..&&&&&&&XX+...........
..................................................................$&&&&&&&&&&&&&&&&&&&Xx&x&........
.................................................................+&&&&&&&&&&&&&&&&&&&&&X&&;........
.................................................................&&&&&&&&&&&&&&&&&&&&&&&:..........
.................................................................:&&&&&;.:+++;..:&&&&&&X...........
..................................................................+&&..............;&&&&&;.........
.....................................................................................x::...........
....................:::............................................................................
.......$&+X.....X...::::....:::...::.............X...&..&..&.+...x++.+:..;&...$&...+...............
.......$&..&:...&&x...:::...::...X&&.............X......&..&+.x.:$$X:+:..:&...$X...+...............
.......X&...$$..+x&&...::..::...&$$&...............................................................
......::.:&....&.x+:;&.......;&;:$X....................................&;.$X:&+.X&&................
......:::..&:..:&.;X&x&&&&&X&X..&+....::..............................;&+.&x.&X&&&&:...............
........:&;::::+&.;X;:.....x:...:Xx..::....................................................&.......
.......$&:::+$&..&X:............&+..:.............&.x&XX+..$XXXXXXXXXXXXXXXXXXXXXXXXXXXXX+.&.......
.......+$+::&$..;+:.............+$$:..............$.;$:.x..x$$$$$$$$$$$$$$$$$$$$$$$$$$$$$..&.......
..........&:&$..x:..........:::....:x......................................................&.......
........;&xXx;.X:..........:::x:....&..................::&X..&+.XX.$$..:;..:;&x..&..&;.&;..&.......
.......$&x&..:+&x+;:........::::..+&:.................$&&&X.&&&x.&&&..x...&&&&x.&&&;.&&&...&.......
........:&x&:;&xxxxxx:...........;;.............$;.........................................&.......
..........&&+;X..::;;;;::.........:$&$:......x&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&.......
..........&&&$:.....................&..............................................................
.;&:.:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::.:&:.
;;.++&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&x+.+;
.:X$...........................................................................................X$..
.$x............................................................................................$X..
.$x............................................................................................$X..
.$x...;+:........+.......+++..:++.............++.:...;:...:..;.................................$X..
.$x..X.::..&&X..&&x.....:+::X..x..+:X...;+$.+....X:::&&...$.+&&................................$X..
.$x..+..:.x..;..........::.....x..+:.:;;...&.&..&X...&.X..$....................................$X..
.$x..............:...........................................:.................................$X..
.$x............................................................................................$X..
.$x............................................................................................$X..
.$x............................................................................................$X..
.$x............................................................................................$X..
.$x............................................................................................$X..
.:&x:.........................................................................................:x&..
+x+X;XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX+X+x+
..x.............................................................................................x:.";
            Console.WriteLine(titleArt);
        }





    }
}

